Управление_торговлей.ПБТ/src/Reports/ФормаОбщегоЖурнала/ФормаОбщегоЖурнала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ФормаОбщегоЖурнала</name>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличноеПолеОбразцы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.АктОтбора</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗамеса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличноеПолеДокументы</name>
    <attributes>
      <name>ВИСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПротоколАнализа</types>
        <types>DocumentRef.УдостоверениеКачества</types>
        <types>String</types>
        <types>DocumentRef.АктОтбора</types>
        <types>DocumentRef.КартаРазрешения</types>
        <types>DocumentRef.АктПриемаОбразцов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

Управление_торговлей.ПБТ/src/Documents/УдостоверениеКачества/УдостоверениеКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УдостоверениеКачества</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Технолог</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаХаляль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Декларация</name>
    <type>
      <types>CatalogRef.СертификатыНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаАнглийском</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоТУ</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ПротоколыАнализа</name>
    <attributes>
      <name>ПротоколАнализа</name>
      <type>
        <types>DocumentRef.ПротоколАнализа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Reports/ФормаОбщегоЖурнала/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбразцов()
	лРезультат = Лаборатория_Сервер.гл_ПолучитьОбщуюТаблицуОбразцов(Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания, Отчет.Лаборатория);	
	Отчет.ТабличноеПолеОбразцы.Загрузить(лРезультат.Выгрузить());
КонецПроцедуры	


&НаСервере
Процедура ТабличноеПолеОбразцыПриАктивизацииСтрокиНаСервере(ПараметрыСтроки)
	
	лРезультат = Лаборатория_Сервер.гл_ПолучитьДокументыПоОбразцу(ПараметрыСтроки.Номенклатура, ПараметрыСтроки.КодПродукта, ПараметрыСтроки.ДокументПоступления);
	Отчет.ТабличноеПолеДокументы.Загрузить(лРезультат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеОбразцыПриАктивизацииСтроки(Элемент)
	
	ОбновитьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеДокументыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
	ТекДанные = Элементы.ТабличноеПолеДокументы.ТекущиеДанные;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторияПриИзменении(Элемент)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры

&НаСервере
Процедура СоздатьУКНаСервере()
	
	Для каждого СтрТЗ Из Отчет.ТабличноеПолеДокументы Цикл
		
		Если ТипЗнч(СтрТЗ.Документ) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
			
			//Если СтрТЗ.Документ.ВидИсследования<>Справочники.ВидыИсследований.Органолептика Тогда
			//	Продолжить;
			//КонецЕсли;
			
			Протокол = СтрТЗ.Документ;
			ТекНом = Протокол.Номенклатура;
			
			//находим сертификат
			ВыбДекл = Лаборатория_Сервер.ПолучитьРазрешительныеДокументыНаНом(ТекНом, ТекущаяДатаСеанса());
			Если НЕ ЗначениеЗаполнено(ВыбДекл) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для номенклатуры "+ТекНом+" не найден действующий сертификат");
			КонецЕсли;   
			
			//
			ДокУК = Документы.УдостоверениеКачества.СоздатьДокумент();
			СтандартнаяОбработка = Истина;
			ДокУК.Заполнить(Протокол);
			ДокУК.Дата = ТекущаяДатаСеанса();
			
			ДокУК.Пользователь = Пользователи.ТекущийПользователь();
			
			Попытка
				ДокУК.Записать();
				ДокУК.Записать(РежимЗаписиДокумента.Проведение)
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУК(Команда)
	СоздатьУКНаСервере();
	ОбновитьТаблицуДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеДокументыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
	//Док = Элемент.ТекущиеДанные.Документ;
	//ФормаДока = Док.ПолучитьФорму();
	//ФормаДока.Открыть();
	//ВидДокумента = Док.Метаданные().Имя;
	//П = Новый Структура;
	//П.Вставить("Ключ", Док);
	//ОткрытьФорму("Документ."+ВидДокумента+".ФормаДокумента", П);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуДокументов()
	
	ТекДанные = Элементы.ТабличноеПолеОбразцы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		
		ПараметрыСтроки = Новый Структура;
		ПараметрыСтроки.Вставить("Номенклатура", ТекДанные.Номенклатура);
		ПараметрыСтроки.Вставить("КодПродукта", ТекДанные.КодПродукта);
		ПараметрыСтроки.Вставить("ДокументПоступления", ТекДанные.ДокументПоступления);
		ТабличноеПолеОбразцыПриАктивизацииСтрокиНаСервере(ПараметрыСтроки);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьТаблицуОбразцов();
КонецПроцедуры
